app/controllers/albums_controller.rb

SELECT "albums".* FROM "albums" WHERE "albums"."programmed" = ?  [["programmed", "f"]]
---
  def index
    @albums = Album.all.where(:programmed => false)

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", 11]]
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."album_id" = ?  ORDER BY "tracks"."id" ASC LIMIT 1  [["album_id", 11]]
---
  def tracks
    @album = Album.find(params[:album_id])
    @tracks = @album.tracks.all

INSERT INTO "albums" ("mediaType", "recordLabel", "albumTitle", "artist", "recordingYear", "spotify", "notes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @album = Album.new(album_params)

    respond_to do |format|
      if @album.save

UPDATE "albums" SET "spotify" = ?, "updated_at" = ? WHERE "albums"."id" = ?  [["spotify", "https://open.spotify.com/track/78GykAuZzZEZz3qdHdOdZZ"], ["updated_at", "2015-11-18 22:09:52.698097"], ["id", 7]]
---
  def update
    respond_to do |format|
      if @album.update(album_params)

SELECT "albums".* FROM "albums" WHERE "albums"."programmed" = ?  [["programmed", "t"]]
---
  def programmed
    @albums = Album.all.where(:programmed => true)

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", nil]]
UPDATE "albums" SET "programmed" = ?, "updated_at" = ? WHERE "albums"."id" = ?  [["programmed", "t"], ["updated_at", "2015-12-02 06:08:51.891552"], ["id", 11]]
---
  def program
    @album = Album.find(params[:album_id])
    respond_to do |format|
      if @album.update(:programmed => true)

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", 17]]
---
  def add_track
      @album = Album.find(params[:album_id])

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", 11]]
---
  def new_track
      @album = Album.find(params[:album_id])

DELETE FROM "albums" WHERE "albums"."id" = ?  [["id", 1]]
---
  def destroy
    @album.destroy

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", 7]]
---
    def set_album
      @album = Album.find(params[:id])