app/controllers/tracks_controller.rb

SELECT "tracks".* FROM "tracks"
---
  def index
    @tracks = Track.all

INSERT INTO "tracks" ("name", "artist", "format", "explicit", "automation", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", ""], ["artist", ""], ["format", ""], ["explicit", "f"], ["automation", "f"], ["created_at", "2015-11-21 03:09:03.351611"], ["updated_at", "2015-11-21 03:09:03.351611"]]
---
  def create
    @track = Track.new(track_params)

    respond_to do |format|
      if @track.save

UPDATE "tracks" SET "explicit" = ?, "automation" = ?, "updated_at" = ? WHERE "tracks"."id" = ?  [["explicit", "t"], ["automation", "t"], ["updated_at", "2015-12-04 02:33:11.720135"], ["id", 40]]
---
  def update
    respond_to do |format|
      if @track.update(track_params)

DELETE FROM "tracks" WHERE "tracks"."id" = ?  [["id", 1]]
---
  def destroy
    @track.destroy

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = ? LIMIT 1  [["id", 40]]
---
    def set_track
      @track = Track.find(params[:id])